Repository: theilm/flow-development-collection
Catalog: Neos.Flow/Resources/Private/Translations/*/ValidationErrors.xlf
Languages: pt

source: Only regular characters (a to z, umlauts, ...) and numbers are allowed.
pt: Apenas caracteres (a até z), podendo ser acentuados, e números são permitidos.

source: The given value is expected to be {0}.
pt: Esperava-se que o valor fornecido fosse {0}.

source: The given subject is not a collection
pt: O valor fornecido não é uma coleção

source: The given subject is not countable
pt: O valor fornecido não é do tipo Countable

source: The count must be between {0,number} and {1,number}
pt: O número de elementos deverá estar entre {0,number} e {1,number}

source: The given value is not a valid date
pt: O valor fornecido não é uma data válida

source: The given date must be between {0,datetime,dateTime} and {1,datetime,dateTime}
pt: A data fornecida deverá estar entre {0,datetime,dateTime} e {1,datetime,dateTime}

source: The given date must be after {0,datetime,dateTime}
pt: A data fornecida deverá ser posterior a {0,datetime,dateTime}

source: The given date must be before {0,datetime,dateTime}
pt: A data fornecida deverá ser anterior a {0,datetime,dateTime}

source: The "locale" option can be only set to string identifier, or Locale object
pt: A opção "locale" só pode ser definida com um identificador textual (exemplo: pt-PT), ou como objeto Locale

source: A valid time is expected
pt: É esperada uma definição horária válida

source: A valid date and time is expected
pt: É esperada uma data e hora válida

source: A valid date is expected
pt: É esperada uma data válida

source: Please specify a valid email address
pt: Por favor especifique um endereço de correio eletrónico válido

source: A valid float number is expected
pt: É esperado um Float válido

source: "{0}" cannot be converted to a float value
pt: "{0}" não pode ser convertido num Float

source: Object expected, {0} given
pt: É esperado um Object, foi fornecido {0}

source: A valid integer number is expected
pt: É esperado um número inteiro válido

source: "{0}" is no integer.
pt: "{0}" não é um número inteiro.

source: Only letters, numbers, spaces and certain punctuation marks are expected
pt: Apenas letras, números, espaços e certos sinais de pontuação são esperados

source: Value is no valid I18n locale identifier
pt: O valor não é um identificador válido de locale i18n

source: This property is required
pt: Esta propriedade é obrigatória

source: This property is required
pt: Esta propriedade é obrigatória

source: A valid number is expected
pt: É esperado um número válido

source: Please enter a valid number between {0,number} and {1,number}
pt: Por favor introduza um número válido entre {0,number} e {1,number}

source: The "locale" option can be only set to string identifier, or Locale object
pt: A opção "locale" só pode ser definida com um identificador textual (exemplo: pt-PT), ou como objeto Locale

source: A valid percent number is expected
pt: É esperada uma percentagem válida

source: A valid decimal number is expected
pt: É esperado um número decimal válido

source: The given subject did not match the pattern. Got: {0}
pt: O valor fornecido não coincide com o padrão de captura. Resposta: {0}

source: The given object could not be converted to a string
pt: O objeto fornecido não pode ser convertido numa cadeia de texto

source: The given value is not a valid string
pt: O valor fornecido não é uma cadeia de texto válida

source: The length of this text must be between {0,number} and {1,number} characters
pt: A cadeia de texto deverá ter entre {0,number} e {1,number} caracteres

# 1238108068[0]
source: This field must contain at least {0,number} character
pt: Este campo deverá conter pelo menos {0,number} carácter

# 1238108068[1]
source: This field must contain at least {0,number} characters
pt: Este campo deverá conter pelo menos {0,number} caracteres

# 1238108069[0]
source: This text may not exceed {0,number} character
pt: Este texto não pode ter mais do que {0,number} carácter

# 1238108069[1]
source: This text may not exceed {0,number} characters
pt: Este texto não pode ter mais do que {0,number} caracteres

source: A valid string is expected
pt: É esperada uma cadeia de texto válida

source: Valid text without any XML tags is expected
pt: É esperado texto válido sem sintaxe XML

source: The given subject is not a valid UUID
pt: O valor fornecido não é um UUID válido

source: No validator found for electronic address of type "{0}"
pt: Não foi encontrado nenhum validador para um endereço de correio eletrónico do tipo "{0}"

source: The person name cannot be empty
pt: O nome da pessoa não pode ficar vazio

source: The given value is not a Image instance
pt: O valor fornecido não é do tipo Image

source: The image type "{0}" is not allowed
pt: Não é permitido o uso de imagens do tipo "{0}"

source: The uploaded file is no valid image
pt: O ficheiro enviado não é uma imagem válida

source: The given value is not a Image instance
pt: O valor fornecido não é do tipo Image

source: The actual image width of {0,number} is lower than the allowed minimum width of {1,number}
pt: A imagem tem uma largura de {0,number} que é inferior ao mínimo permitido de {1,number}

source: The actual image width of {0,number} is higher than the allowed maximum width of {1,number}
pt: A imagem tem uma largura de {0,number} que é superior ao máximo permitido de {1,number}

source: The actual image height of {0,number} is lower than the allowed minimum height of {1,number}
pt: A imagem tem uma altura de {0,number} que é inferior ao mínimo permitido de {1,number}

source: The actual image height of {0,number} is higher than the allowed maximum height of {1,number}
pt: A imagem tem uma altura de {0,number} que é superior ao mínimo permitido de {1,number}

source: The given image size of {0,number} x {1,number} is too low for the required minimum resolution of {2,number}
pt: A imagem tem uma dimensão de {0,number} x {1,number} que é inferior à resolução mínima permitida de {2,number}

source: The given image size of {0,number} x {1,number} is too high for the required maximum resolution of {2,number}
pt: A imagem tem uma dimensão de {0,number} x {1,number} que é superior à resolução máxima permitida de {2,number}

source: The given value is not a Image instance
pt: O valor fornecido não é do tipo Image

source: The image orientation must be "{0}"
pt: A imagem deverá ter a orientação "{0}"

source: The image orientation "{0}" is not allowed
pt: Não é permitida a orientação "{0}" da imagem

source: The file extension "{0}" is not allowed.
pt: A extensão de ficheiro "{0}" não é permitida.
